Repository: MonoBrainCell/autodate
Catalog: src/languages/autodate-*.po
Languages: ru_ru

source: This plugin allows you to add dates to your site that will update automatically according to the interval you specify
ru_ru: Этот плагин позволяет добавлять на Ваш сайт даты, которые будут обновляться автоматически в соответствии с определённым Вами интервалом

source: Autodate
ru_ru: Автодата

source: Autodate management
ru_ru: Управление Автодатой

source: An error occurred while transferring data. Refresh the Autodate page and try changing the data again
ru_ru: Возникла ошибка во время передачи данных из формы. Обновите страницу плагина и повторите попытку изменения данных

source: Failed to update data for field *Short description*
ru_ru: Не удалось обновить данные поля *Краткое описание*

source: Failed to update data for field *When to update the date*
ru_ru: Не удалось обновить данные поля *Когда обновить дату*

source: Failed to update data for field *Update frequency*
ru_ru: Не удалось обновить данные поля *Периодичность обновления*

source: Failed to update data for field *Displayed date*
ru_ru: Не удалось обновить данные поля *Отображаемая дата*

source: Failed to update data for field *How much to shift the date*
ru_ru: Не удалось обновить данные поля *На сколько сдвинуть дату*

source: Failed to update the state of switch *Switched on/Switched off*
ru_ru: Не удалось обновить состояние переключателя *Вкл/Выкл*

source: An error occured while saving your changes. Refresh the plugin page
ru_ru: Произошла ошибка во время сохранения внесённых изменений. Обновите страницу плагина

source: New date information has been saved
ru_ru: Сохранение новой даты выполнено

source: Data changes saved
ru_ru: Сохранение изменений выполнено

source: does not exist
ru_ru: не существует

source: Switched on
ru_ru: Вкл

source: Switched off
ru_ru: Выкл

source: Save changes
ru_ru: Сохранить изменения

source: Delete this data
ru_ru: Удалить обновляемую дату

source: Are you sure you want to delete this data?
ru_ru: Вы уверены, что хотите удалить эту дату?

source: Data has not been deleted!\n Refresh the Autodate page and try again
ru_ru: Не удалось удалить указанную дату!\n Обновите страницу плагина и повторите попытку

source: Data deleted successfully
ru_ru: Дата удалена

source: Want to add new data?
ru_ru: Хотите добавить новую дату?

source: On this plugin page you can: manage automatically updated dates, create new ones, delete existing ones
ru_ru: На этой странице плагина Вы можете: управлять автоматически обновляемыми датами, создавать новые, а также удалять ранее созданные

source: Autodate usage hint
ru_ru: Подсказка по использованию плагина

source: How to use Autodate
ru_ru: Как использовать этот плагин

source: To use the plugin, you need to take a few steps:
ru_ru: Для использования Автодаты Вам следует произвести несколько действий:

source: Create new date (button <strong>Add date</strong>)
ru_ru: Создать новую дату (кнопка <strong>Добавить дату</strong>)

source: Customize the date:
ru_ru: Настроить дату:

source: Specify the value of the <strong>Displayed date</strong>
ru_ru: Определить <strong>Отображаемую дату</strong>

source: Specify the value of the <strong>How much to shift the date</strong>
ru_ru: Определить <strong>На сколько сдвинуть дату</strong>

source: Specify the value of the <strong>When to update the date</strong>
ru_ru: Определить <strong>Когда обновить дату</strong>

source: Specify the value of the <strong>Update frequency</strong>
ru_ru: Определить <strong>Периодичность обновления</strong>

source: For further convenience of editing the date, it is recommended to specify a value for the <strong>short description</strong>
ru_ru: Для дальнейшего удобства редактирования даты рекомендуется определить <strong>Краткое описание</strong>

source: Switch on date (<strong>Switched on/Switched off</strong>)<br><em>Please note that if the target date is <strong>switched off</strong>, then it will not be displayed on the site, BUT it will be updated in accordance with the specified settings.</em>
ru_ru: Включить дату (<strong>Вкл./Выкл.</strong>)<br><em>Обратите внимание, что, если целевая дата будет выключена (<strong>Выкл.</strong>), то она не будет отображаться на сайте, НО она будет обновляться в соответствии с указанными настройками</em>

source: Save the date (button <strong>Save changes</strong>)
ru_ru: Сохранить дату (кнопка <strong>Сохранить изменения</strong>)

source: Copy the generated <strong>shortcode</strong>
ru_ru: Скопировать сформировавшийся <strong>шорткод</strong>

source: Add <strong>shortcode</strong> to post or page content<br><em>Please note that the date will be displayed in the format specified in your Wordpress settings ( <strong>Settings</strong> --> <strong>General</strong> --> item <strong>Date format</strong> )</em><br>P.S. Please note that the <strong style='color: #f00;'>Autodate only works with the date</strong>, data that determine the time (hours, minutes, seconds) are not taken into account.
ru_ru: Добавить <strong>шорткод</strong> в контент записи или страницы<br><em>Обратите внимание на то, что дата будет отображаться в том формате, который был указан в настройках Вашего Wordpress (см. <strong>Настройки</strong> --> <strong>Общее</strong> --> настройка <strong>Формат даты</strong> )</em><br>P.S. Пожалуйста, обратите внимание на то, что <strong style='color: #f00;'>Автодата работает только с датой</strong>, данные определяющие время (часы, минуты, секунды) не учитываются.

source: You can also:
ru_ru: Также Вы можете:

source: Delete previously created dates (red button <strong>X</strong>)
ru_ru: Удалять ранее созданные даты (красная кнопка <strong>X</strong>)

source: Edit settings of previously created dates (Remember to save your changes - button <strong>Save changes</strong>)
ru_ru: Редактировать настройки ранее созданных дат (Не забывайте сохранять внесённые изменения - кнопка <strong>Сохранить изменения</strong>)

source: How to manage date settings
ru_ru: Как работать с датами

source: Let's say the Autodate settings fields contain the following values:
ru_ru: Предположим, что поля настройки Автодаты имеют следующие значения:

source: <strong>Displayed date:</strong> 15.01.2021
ru_ru: <strong>Отображаемая дата:</strong> 15.01.2021

source: How much to shift the date
ru_ru: На сколько сдвинуть дату

source: <strong>When to update the date:</strong> 13.01.2021
ru_ru: <strong>Когда обновить дату:</strong> 13.01.2021

source: Update frequency
ru_ru: Периодичность обновления

source: This means that until <strong>13.01.2021</strong> the website will display the date <strong>15.01.2021</strong>.<br>From <strong>13.01.2021</strong> to <strong>22.01.2021</strong> <em>(13.01 + 10 is the date of the next update)</em> the date on the website will be as follows: <strong>25.01.2021</strong> <em>(15.01 + 10 is the date shift)</em>
ru_ru: Это значит что до <strong>13.01.2021</strong> на сайте будет отображаться дата <strong>15.01.2021</strong>.<br> Начиная с <strong>13.01.2021</strong> и до <strong>22.01.2021</strong> <em>(13.01 + 10 - дата следующего обновления)</em> дата на сайте будет такой: <strong>25.01.2021</strong> <em>(15.01 + 10 - сдвиг даты)</em>

source: <th>Switch on/Switch off </th><th>Shortcode</th><th>Short description</th><th>Displayed date</th><th>How much to shift the date</th><th>When to update the date</th><th>Update frequency</th>
ru_ru: <th>Вкл/Выкл</th><th>Шорткод</th><th>Краткое описание</th><th>Отображаемая дата</th><th>На сколько сдвинуть дату</th><th>Когда обновить дату</th><th>Периодичность обновления</th>

source: Add date
ru_ru: Добавить дату
